Revit 2026 API

# PartCanOffsetFace Method

---

Checks if it is possible to offset the given face.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanOffsetFace(
	Face face
)
```
```vb
Public Function CanOffsetFace (
	face As Face
) As Boolean
```
```cpp
public:
bool CanOffsetFace(
	Face^ face
)
```
```fsharp
member CanOffsetFace :
        face : Face -> bool
```

#### Parameters

face Face
     face to be checked.

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

Part Class

Autodesk.Revit.DB Namespace